""" 
เครื่องคำนวณค่าไฟฟ้าแบบขั้นบันได
เขียนโปรแกรมคำนวณค่าไฟฟ้าจากจำนวนหน่วยไฟฟ้าที่ใช้ในเดือนนั้น โดยใช้ฟังก์ชัน  calculate_electricity_cost(units) 

    ค่าไฟฟ้าขึ้นกับปริมาณการใช้งาน

    จำนวนหน่วยที่ใช้    อัตราต่อหน่วย
    1–50 หน่วยแรก        2.50 บาท
    51–100 หน่วย         3.00 บาท
    101–200 หน่วย        3.50 บาท
    มากกว่า 200 หน่วย     4.00 บาท

    ให้คิดค่าบริการคงที่เพิ่มอีก 25 บาทต่อเดือน


    เงื่อนไข
        •	โปรแกรมแสดงเมนูวนซ้ำ
        •	ผู้ใช้เลือก  1  เพื่อคำนวณค่าไฟ
        •	ผู้ใช้เลือก  2  เพื่อออกจากโปรแกรม
        •	หากเลือกเมนูอื่น ให้แจ้งว่าเลือกเมนูไม่ถูกต้อง
        •	จำนวนหน่วยไฟฟ้าต้องไม่ติดลบ
        •	ให้แสดงรายละเอียดค่าไฟแต่ละช่วง และยอดรวมสุทธิ

    ตัวอย่างหน้าจอ
        ===== โปรแกรมคำนวณค่าไฟฟ้า =====
        1. คำนวณค่าไฟ
        2. ออกจากโปรแกรม
        เลือกเมนู: 1

        กรอกจำนวนหน่วยไฟฟ้า: 120

        รายละเอียดค่าไฟ:
        1-50 หน่วย: 125.00 บาท
        51-100 หน่วย: 150.00 บาท
        101-120 หน่วย: 70.00 บาท
        ค่าบริการ: 25.00 บาท
        รวมค่าไฟทั้งสิ้น: 370.00 บาท
"""

def calculate_electricity_cost(units):

   cost = 0

   if units <= 50:
       cost = units * 2.50

   elif units <= 100:
       cost = (50 * 2.50) + ((units - 50) * 3.00)

   elif units <= 200:
       cost = (50 * 2.50) + (50 * 3.00) + ((units - 100) * 3.50)

   else:
       cost = (50 * 2.50) + (50 * 3.00) + (100 * 3.50) + ((units - 200) * 4.00)

   service_charge = 25
   total = cost + service_charge

   return cost, service_charge, total


while True:

   print("\n===== โปรแกรมคำนวณค่าไฟฟ้า =====")
   print("1. คำนวณค่าไฟ")
   print("2. ออกจากโปรแกรม")

   choice = input("เลือกเมนู: ")

   if choice == "1":

       units = float(input("กรอกจำนวนหน่วยไฟฟ้า: "))

       if units < 0:
           print("จำนวนหน่วยไฟฟ้าต้องไม่ติดลบ")
           continue

       cost, service, total = calculate_electricity_cost(units)

       print("\nรายละเอียดค่าไฟ:")
       print(f"ค่าไฟฟ้า: {cost:.2f} บาท")
       print(f"ค่าบริการ: {service:.2f} บาท")
       print(f"รวมค่าไฟทั้งสิ้น: {total:.2f} บาท")

   elif choice == "2":

       print("ออกจากโปรแกรม")
       break

   else:
       print("กรุณาเลือกเมนู 1 หรือ 2")